app/views/contacts/index.html.erb

<script type="text/javascript">
  $(function() {
    // App.contactsController.loadAll(<%= @contacts.to_json.html_safe %>);
    App.contactsController.findAll();
  });
---
SELECT "contacts".* FROM "contacts"